; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=417, out_folder=./training, instance_id=99, seed=2123, goal_proportion=0.03

(define (problem blocksworld-99)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 b385 b386 b387 b388 b389 b390 b391 b392 b393 b394 b395 b396 b397 b398 b399 b400 b401 b402 b403 b404 b405 b406 b407 b408 b409 b410 b411 b412 b413 b414 b415 b416 b417 - object)
 (:init 
    (arm-empty)
    (clear b392)
    (on b392 b405)
    (on b405 b89)
    (on b89 b122)
    (on-table b122)
    (clear b290)
    (on-table b290)
    (clear b152)
    (on-table b152)
    (clear b15)
    (on b15 b184)
    (on b184 b200)
    (on-table b200)
    (clear b409)
    (on b409 b241)
    (on b241 b271)
    (on b271 b222)
    (on b222 b65)
    (on-table b65)
    (clear b254)
    (on-table b254)
    (clear b160)
    (on b160 b46)
    (on b46 b305)
    (on b305 b358)
    (on b358 b30)
    (on b30 b246)
    (on-table b246)
    (clear b388)
    (on b388 b235)
    (on b235 b216)
    (on b216 b29)
    (on b29 b67)
    (on b67 b335)
    (on-table b335)
    (clear b114)
    (on-table b114)
    (clear b338)
    (on b338 b269)
    (on-table b269)
    (clear b72)
    (on b72 b153)
    (on b153 b95)
    (on b95 b276)
    (on b276 b53)
    (on b53 b132)
    (on-table b132)
    (clear b69)
    (on b69 b267)
    (on-table b267)
    (clear b270)
    (on b270 b245)
    (on-table b245)
    (clear b330)
    (on-table b330)
    (clear b131)
    (on b131 b390)
    (on b390 b355)
    (on-table b355)
    (clear b229)
    (on b229 b20)
    (on-table b20)
    (clear b58)
    (on b58 b262)
    (on b262 b78)
    (on b78 b161)
    (on b161 b128)
    (on b128 b133)
    (on b133 b143)
    (on b143 b101)
    (on-table b101)
    (clear b311)
    (on b311 b11)
    (on b11 b164)
    (on b164 b337)
    (on-table b337)
    (clear b341)
    (on-table b341)
    (clear b302)
    (on b302 b9)
    (on-table b9)
    (clear b49)
    (on-table b49)
    (clear b308)
    (on b308 b41)
    (on b41 b386)
    (on b386 b102)
    (on-table b102)
    (clear b87)
    (on b87 b48)
    (on b48 b332)
    (on b332 b141)
    (on-table b141)
    (clear b189)
    (on b189 b148)
    (on-table b148)
    (clear b252)
    (on-table b252)
    (clear b144)
    (on b144 b348)
    (on b348 b401)
    (on b401 b376)
    (on b376 b60)
    (on-table b60)
    (clear b389)
    (on b389 b367)
    (on b367 b398)
    (on-table b398)
    (clear b230)
    (on b230 b2)
    (on b2 b411)
    (on-table b411)
    (clear b297)
    (on-table b297)
    (clear b150)
    (on b150 b27)
    (on b27 b193)
    (on b193 b349)
    (on-table b349)
    (clear b181)
    (on b181 b201)
    (on-table b201)
    (clear b353)
    (on b353 b45)
    (on b45 b166)
    (on b166 b206)
    (on-table b206)
    (clear b213)
    (on b213 b263)
    (on-table b263)
    (clear b61)
    (on-table b61)
    (clear b227)
    (on b227 b300)
    (on b300 b248)
    (on b248 b400)
    (on b400 b360)
    (on b360 b178)
    (on b178 b272)
    (on b272 b365)
    (on b365 b381)
    (on b381 b56)
    (on-table b56)
    (clear b318)
    (on b318 b51)
    (on b51 b198)
    (on b198 b228)
    (on b228 b91)
    (on b91 b55)
    (on b55 b21)
    (on b21 b125)
    (on b125 b121)
    (on b121 b183)
    (on b183 b250)
    (on-table b250)
    (clear b107)
    (on b107 b196)
    (on b196 b8)
    (on b8 b94)
    (on b94 b173)
    (on b173 b194)
    (on-table b194)
    (clear b84)
    (on b84 b6)
    (on b6 b80)
    (on-table b80)
    (clear b396)
    (on b396 b368)
    (on-table b368)
    (clear b399)
    (on b399 b232)
    (on-table b232)
    (clear b336)
    (on b336 b59)
    (on b59 b284)
    (on b284 b40)
    (on b40 b242)
    (on-table b242)
    (clear b208)
    (on b208 b182)
    (on b182 b12)
    (on b12 b75)
    (on b75 b33)
    (on b33 b412)
    (on b412 b4)
    (on b4 b255)
    (on-table b255)
    (clear b105)
    (on b105 b385)
    (on-table b385)
    (clear b264)
    (on b264 b147)
    (on b147 b324)
    (on-table b324)
    (clear b52)
    (on b52 b259)
    (on b259 b118)
    (on-table b118)
    (clear b273)
    (on b273 b70)
    (on b70 b343)
    (on b343 b249)
    (on-table b249)
    (clear b234)
    (on b234 b402)
    (on b402 b345)
    (on b345 b81)
    (on b81 b253)
    (on b253 b165)
    (on b165 b268)
    (on b268 b120)
    (on b120 b301)
    (on b301 b275)
    (on-table b275)
    (clear b233)
    (on b233 b334)
    (on-table b334)
    (clear b99)
    (on b99 b207)
    (on b207 b244)
    (on-table b244)
    (clear b236)
    (on-table b236)
    (clear b23)
    (on-table b23)
    (clear b42)
    (on-table b42)
    (clear b111)
    (on b111 b192)
    (on-table b192)
    (clear b188)
    (on b188 b417)
    (on b417 b325)
    (on b325 b211)
    (on b211 b321)
    (on b321 b162)
    (on b162 b364)
    (on-table b364)
    (clear b287)
    (on-table b287)
    (clear b326)
    (on-table b326)
    (clear b310)
    (on b310 b85)
    (on b85 b314)
    (on b314 b288)
    (on b288 b191)
    (on b191 b333)
    (on-table b333)
    (clear b50)
    (on b50 b379)
    (on-table b379)
    (clear b18)
    (on b18 b320)
    (on-table b320)
    (clear b127)
    (on-table b127)
    (clear b14)
    (on-table b14)
    (clear b158)
    (on-table b158)
    (clear b169)
    (on-table b169)
    (clear b370)
    (on b370 b312)
    (on b312 b256)
    (on b256 b124)
    (on-table b124)
    (clear b369)
    (on b369 b294)
    (on b294 b329)
    (on b329 b296)
    (on b296 b25)
    (on b25 b68)
    (on b68 b205)
    (on-table b205)
    (clear b1)
    (on-table b1)
    (clear b362)
    (on-table b362)
    (clear b137)
    (on-table b137)
    (clear b90)
    (on-table b90)
    (clear b44)
    (on b44 b185)
    (on b185 b352)
    (on b352 b140)
    (on b140 b134)
    (on b134 b306)
    (on-table b306)
    (clear b219)
    (on b219 b281)
    (on b281 b100)
    (on b100 b406)
    (on-table b406)
    (clear b317)
    (on b317 b346)
    (on b346 b209)
    (on b209 b5)
    (on b5 b237)
    (on-table b237)
    (clear b224)
    (on b224 b174)
    (on-table b174)
    (clear b373)
    (on b373 b278)
    (on b278 b171)
    (on-table b171)
    (clear b108)
    (on b108 b309)
    (on b309 b292)
    (on b292 b190)
    (on b190 b391)
    (on b391 b393)
    (on b393 b123)
    (on b123 b280)
    (on b280 b187)
    (on b187 b180)
    (on b180 b139)
    (on b139 b176)
    (on b176 b155)
    (on b155 b159)
    (on-table b159)
    (clear b79)
    (on b79 b34)
    (on b34 b394)
    (on b394 b377)
    (on b377 b31)
    (on b31 b380)
    (on-table b380)
    (clear b265)
    (on b265 b197)
    (on b197 b93)
    (on b93 b126)
    (on b126 b257)
    (on b257 b83)
    (on b83 b97)
    (on b97 b404)
    (on b404 b154)
    (on b154 b319)
    (on b319 b113)
    (on b113 b136)
    (on b136 b327)
    (on b327 b299)
    (on-table b299)
    (clear b347)
    (on b347 b339)
    (on b339 b3)
    (on b3 b104)
    (on b104 b403)
    (on b403 b408)
    (on-table b408)
    (clear b375)
    (on b375 b315)
    (on b315 b407)
    (on b407 b374)
    (on b374 b172)
    (on b172 b238)
    (on b238 b142)
    (on b142 b220)
    (on b220 b96)
    (on b96 b410)
    (on b410 b221)
    (on b221 b344)
    (on b344 b168)
    (on b168 b204)
    (on b204 b331)
    (on-table b331)
    (clear b231)
    (on b231 b117)
    (on b117 b215)
    (on b215 b73)
    (on b73 b115)
    (on b115 b47)
    (on b47 b103)
    (on b103 b291)
    (on-table b291)
    (clear b175)
    (on b175 b112)
    (on b112 b274)
    (on b274 b35)
    (on-table b35)
    (clear b316)
    (on b316 b170)
    (on b170 b71)
    (on-table b71)
    (clear b16)
    (on b16 b303)
    (on b303 b110)
    (on b110 b359)
    (on-table b359)
    (clear b277)
    (on b277 b62)
    (on b62 b351)
    (on-table b351)
    (clear b76)
    (on b76 b307)
    (on-table b307)
    (clear b167)
    (on b167 b313)
    (on-table b313)
    (clear b304)
    (on b304 b387)
    (on b387 b226)
    (on b226 b26)
    (on-table b26)
    (clear b415)
    (on b415 b356)
    (on b356 b146)
    (on b146 b199)
    (on b199 b145)
    (on b145 b397)
    (on b397 b366)
    (on b366 b357)
    (on b357 b240)
    (on b240 b289)
    (on-table b289)
    (clear b371)
    (on b371 b382)
    (on-table b382)
    (clear b24)
    (on b24 b19)
    (on b19 b74)
    (on-table b74)
    (clear b285)
    (on b285 b106)
    (on b106 b282)
    (on b282 b225)
    (on b225 b119)
    (on b119 b32)
    (on-table b32)
    (clear b88)
    (on-table b88)
    (clear b283)
    (on b283 b218)
    (on-table b218)
    (clear b340)
    (on-table b340)
    (clear b57)
    (on b57 b261)
    (on-table b261)
    (clear b251)
    (on b251 b414)
    (on-table b414)
    (clear b195)
    (on b195 b54)
    (on b54 b186)
    (on-table b186)
    (clear b223)
    (on-table b223)
    (clear b39)
    (on-table b39)
    (clear b258)
    (on b258 b66)
    (on b66 b38)
    (on-table b38)
    (clear b243)
    (on b243 b266)
    (on b266 b279)
    (on-table b279)
    (clear b342)
    (on b342 b395)
    (on b395 b10)
    (on b10 b138)
    (on b138 b82)
    (on b82 b179)
    (on b179 b214)
    (on-table b214)
    (clear b130)
    (on-table b130)
    (clear b210)
    (on b210 b163)
    (on b163 b156)
    (on-table b156)
    (clear b77)
    (on b77 b247)
    (on b247 b298)
    (on b298 b202)
    (on b202 b13)
    (on b13 b416)
    (on b416 b295)
    (on b295 b92)
    (on b92 b413)
    (on b413 b350)
    (on-table b350)
    (clear b22)
    (on b22 b151)
    (on-table b151)
    (clear b109)
    (on b109 b328)
    (on-table b328)
    (clear b177)
    (on b177 b43)
    (on b43 b63)
    (on b63 b135)
    (on-table b135)
    (clear b378)
    (on b378 b37)
    (on-table b37)
    (clear b260)
    (on b260 b149)
    (on b149 b372)
    (on b372 b157)
    (on-table b157)
    (clear b384)
    (on-table b384)
    (clear b323)
    (on-table b323)
    (clear b203)
    (on-table b203)
    (clear b354)
    (on-table b354)
    (clear b64)
    (on b64 b98)
    (on b98 b322)
    (on b322 b239)
    (on b239 b363)
    (on-table b363)
    (clear b17)
    (on b17 b86)
    (on b86 b36)
    (on-table b36)
    (clear b7)
    (on-table b7)
    (clear b129)
    (on b129 b286)
    (on b286 b293)
    (on b293 b116)
    (on b116 b217)
    (on b217 b28)
    (on b28 b212)
    (on b212 b383)
    (on b383 b361)
    (on-table b361))
 (:goal  (and 
    (clear b4)
    (on-table b4)
    (clear b6)
    (on b6 b5)
    (on b5 b10)
    (on b10 b9)
    (on b9 b11)
    (on-table b11)
    (clear b7)
    (on b7 b2)
    (on b2 b3)
    (on b3 b8)
    (on b8 b1)
    (on b1 b12)
    (on-table b12))))

; plan
1. (unstack b107 b196)
   deleted: (on b107 b196) (clear b107) (arm-empty)
   added: (holding b107) (clear b196)
   goals met: 1 of 15
2. (putdown b107)
   deleted: (holding b107)
   added: (clear b107) (arm-empty) (on-table b107)
   goals met: 1 of 15
3. (unstack b196 b8)
   deleted: (on b196 b8) (clear b196) (arm-empty)
   added: (holding b196) (clear b8)
   goals met: 1 of 15
4. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 1 of 15
5. (unstack b208 b182)
   deleted: (on b208 b182) (clear b208) (arm-empty)
   added: (holding b208) (clear b182)
   goals met: 1 of 15
6. (putdown b208)
   deleted: (holding b208)
   added: (clear b208) (arm-empty) (on-table b208)
   goals met: 1 of 15
7. (unstack b182 b12)
   deleted: (on b182 b12) (clear b182) (arm-empty)
   added: (holding b182) (clear b12)
   goals met: 1 of 15
8. (putdown b182)
   deleted: (holding b182)
   added: (clear b182) (arm-empty) (on-table b182)
   goals met: 1 of 15
9. (unstack b12 b75)
   deleted: (on b12 b75) (clear b12) (arm-empty)
   added: (holding b12) (clear b75)
   goals met: 1 of 15
10. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 15
11. (unstack b230 b2)
   deleted: (on b230 b2) (clear b230) (arm-empty)
   added: (holding b230) (clear b2)
   goals met: 2 of 15
12. (putdown b230)
   deleted: (holding b230)
   added: (clear b230) (arm-empty) (on-table b230)
   goals met: 2 of 15
13. (unstack b302 b9)
   deleted: (on b302 b9) (clear b302) (arm-empty)
   added: (holding b302) (clear b9)
   goals met: 2 of 15
14. (putdown b302)
   deleted: (holding b302)
   added: (clear b302) (arm-empty) (on-table b302)
   goals met: 2 of 15
15. (unstack b311 b11)
   deleted: (on b311 b11) (clear b311) (arm-empty)
   added: (holding b311) (clear b11)
   goals met: 2 of 15
16. (putdown b311)
   deleted: (holding b311)
   added: (clear b311) (arm-empty) (on-table b311)
   goals met: 2 of 15
17. (unstack b11 b164)
   deleted: (on b11 b164) (clear b11) (arm-empty)
   added: (holding b11) (clear b164)
   goals met: 2 of 15
18. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 3 of 15
19. (unstack b317 b346)
   deleted: (on b317 b346) (clear b317) (arm-empty)
   added: (holding b317) (clear b346)
   goals met: 3 of 15
20. (putdown b317)
   deleted: (holding b317)
   added: (clear b317) (arm-empty) (on-table b317)
   goals met: 3 of 15
21. (unstack b342 b395)
   deleted: (on b342 b395) (clear b342) (arm-empty)
   added: (holding b342) (clear b395)
   goals met: 3 of 15
22. (putdown b342)
   deleted: (holding b342)
   added: (clear b342) (arm-empty) (on-table b342)
   goals met: 3 of 15
23. (unstack b346 b209)
   deleted: (on b346 b209) (clear b346) (arm-empty)
   added: (holding b346) (clear b209)
   goals met: 3 of 15
24. (putdown b346)
   deleted: (holding b346)
   added: (clear b346) (arm-empty) (on-table b346)
   goals met: 3 of 15
25. (unstack b209 b5)
   deleted: (on b209 b5) (clear b209) (arm-empty)
   added: (holding b209) (clear b5)
   goals met: 3 of 15
26. (putdown b209)
   deleted: (holding b209)
   added: (clear b209) (arm-empty) (on-table b209)
   goals met: 3 of 15
27. (unstack b347 b339)
   deleted: (on b347 b339) (clear b347) (arm-empty)
   added: (holding b347) (clear b339)
   goals met: 3 of 15
28. (putdown b347)
   deleted: (holding b347)
   added: (clear b347) (arm-empty) (on-table b347)
   goals met: 3 of 15
29. (unstack b339 b3)
   deleted: (on b339 b3) (clear b339) (arm-empty)
   added: (holding b339) (clear b3)
   goals met: 3 of 15
30. (putdown b339)
   deleted: (holding b339)
   added: (clear b339) (arm-empty) (on-table b339)
   goals met: 3 of 15
31. (unstack b395 b10)
   deleted: (on b395 b10) (clear b395) (arm-empty)
   added: (holding b395) (clear b10)
   goals met: 3 of 15
32. (putdown b395)
   deleted: (holding b395)
   added: (clear b395) (arm-empty) (on-table b395)
   goals met: 3 of 15
33. (unstack b75 b33)
   deleted: (on b75 b33) (clear b75) (arm-empty)
   added: (holding b75) (clear b33)
   goals met: 3 of 15
34. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 3 of 15
35. (unstack b33 b412)
   deleted: (on b33 b412) (clear b33) (arm-empty)
   added: (holding b33) (clear b412)
   goals met: 3 of 15
36. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 3 of 15
37. (unstack b412 b4)
   deleted: (on b412 b4) (clear b412) (arm-empty)
   added: (holding b412) (clear b4)
   goals met: 4 of 15
38. (putdown b412)
   deleted: (holding b412)
   added: (clear b412) (arm-empty) (on-table b412)
   goals met: 4 of 15
39. (unstack b4 b255)
   deleted: (on b4 b255) (clear b4) (arm-empty)
   added: (holding b4) (clear b255)
   goals met: 3 of 15
40. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 5 of 15
41. (unstack b84 b6)
   deleted: (on b84 b6) (clear b84) (arm-empty)
   added: (holding b84) (clear b6)
   goals met: 6 of 15
42. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 6 of 15
43. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 6 of 15
44. (stack b1 b12)
   deleted: (clear b12) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b12)
   goals met: 7 of 15
45. (unstack b10 b138)
   deleted: (on b10 b138) (clear b10) (arm-empty)
   added: (holding b10) (clear b138)
   goals met: 7 of 15
46. (stack b10 b9)
   deleted: (clear b9) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b9)
   goals met: 8 of 15
47. (unstack b2 b411)
   deleted: (on b2 b411) (clear b2) (arm-empty)
   added: (holding b2) (clear b411)
   goals met: 8 of 15
48. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 9 of 15
49. (unstack b5 b237)
   deleted: (on b5 b237) (clear b5) (arm-empty)
   added: (holding b5) (clear b237)
   goals met: 9 of 15
50. (stack b5 b10)
   deleted: (clear b10) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b10)
   goals met: 10 of 15
51. (unstack b8 b94)
   deleted: (on b8 b94) (clear b8) (arm-empty)
   added: (holding b8) (clear b94)
   goals met: 10 of 15
52. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 11 of 15
53. (unstack b6 b80)
   deleted: (on b6 b80) (clear b6) (arm-empty)
   added: (holding b6) (clear b80)
   goals met: 10 of 15
54. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 12 of 15
55. (unstack b2 b3)
   deleted: (on b2 b3) (clear b2) (arm-empty)
   added: (holding b2) (clear b3)
   goals met: 11 of 15
56. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 11 of 15
57. (unstack b3 b104)
   deleted: (on b3 b104) (clear b3) (arm-empty)
   added: (holding b3) (clear b104)
   goals met: 11 of 15
58. (stack b3 b8)
   deleted: (clear b8) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b8)
   goals met: 12 of 15
59. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 12 of 15
60. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 13 of 15
61. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 12 of 15
62. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 14 of 15
63. (unstack b6 b5)
   deleted: (on b6 b5) (clear b6) (arm-empty)
   added: (holding b6) (clear b5)
   goals met: 12 of 15
64. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 13 of 15
65. (unstack b5 b10)
   deleted: (on b5 b10) (clear b5) (arm-empty)
   added: (holding b5) (clear b10)
   goals met: 12 of 15
66. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 12 of 15
67. (unstack b10 b9)
   deleted: (on b10 b9) (clear b10) (arm-empty)
   added: (holding b10) (clear b9)
   goals met: 11 of 15
68. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 11 of 15
69. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 11 of 15
70. (stack b9 b11)
   deleted: (clear b11) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b11)
   goals met: 12 of 15
71. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 12 of 15
72. (stack b10 b9)
   deleted: (clear b9) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b9)
   goals met: 13 of 15
73. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 13 of 15
74. (stack b5 b10)
   deleted: (clear b10) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b10)
   goals met: 14 of 15
75. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 13 of 15
76. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 15 of 15
